[RM_SupportLauncher_CV X2WeaponTemplate]
FriendlyName="Heavy Smoke Launcher"
FriendlyNamePlural="Heavy Smoke Launchers"
BriefSummary="Adapted from the back-mounted missile launchers of ADVENT's MEC, these smoke launchers can be used to provide some defence for either the SPARK, or the soldiers it's working with."
TacticalText="<Bullet/> Since the warheads don't need to land precisely, these launchers can be made cheaply enough to not affect XCOM's supply flow.\n<Bullet/> The launcher comes equipped with two rounds by default."


[RM_SupportLauncher_CV_Paired X2PairedWeaponTemplate]
FriendlyName="Heavy Smoke Launcher"
FriendlyNamePlural="Heavy Smoke Launchers"
BriefSummary="Adapted from the back-mounted missile launchers of ADVENT's MEC, these smoke launchers can be used to provide some defence for either the SPARK, or the soldiers it's working with."
TacticalText="<Bullet/> Since the warheads don't need to land precisely, these launchers can be made cheaply enough to not affect XCOM's supply flow.\n<Bullet/> The launcher comes equipped with two rounds by default."

[RM_SupportLauncher_MG X2WeaponTemplate]
FriendlyName="Heavy Support Launcher"
FriendlyNamePlural="Heavy Support Launchers"
BriefSummary="An advanced variant of our smoke launchers, these support launchers can support switching from launching smoke grenades to flashbangs on the fly, though it has limited ammo to do so."
TacticalText="<Bullet/> Flashbang rounds take longer to cool down compared to smoke rounds."


[RM_SupportLauncher_MG_Paired X2PairedWeaponTemplate]
FriendlyName="Heavy Support Launcher"
FriendlyNamePlural="Heavy Support Launchers"
BriefSummary="An advanced variant of our smoke launchers, these support launchers can support switching from launching smoke grenades to flashbangs on the fly, though it has limited ammo to do so."
TacticalText="<Bullet/> Flashbang rounds take longer to cool down compared to smoke rounds."


[RM_SPARKLauncher_CV X2WeaponTemplate]
FriendlyName="Adapted Shoulder Launcher"
FriendlyNamePlural="Adapted Shoulder Launchers"
BriefSummary="A salvaged ADVENT MEC launcher, these launchers give our SPARKs the ability to rain explosives on ADVENT from afar."
TacticalText="<Bullet/> These launchers may not be able to destroy cover as easily as frag grenades.\n<Bullet/> They make up for it for range longer than our grenade launchers."

[RM_SPARKLauncher_CV_Paired X2PairedWeaponTemplate]
FriendlyName="Adapted Shoulder Launcher"
FriendlyNamePlural="Adapted Shoulder Launchers"
BriefSummary="A salvaged ADVENT MEC launcher, these launchers give our SPARKs the ability to rain explosives on ADVENT from afar."
TacticalText="<Bullet/> These launchers may not be able to destroy cover as easily as frag grenades.\n<Bullet/> They make up for it for range longer than our grenade launchers."

[RM_SPARKLauncher_MG X2WeaponTemplate]
FriendlyName="Archer Launcher"
FriendlyNamePlural="Archer Launchers"
BriefSummary="An extended variant of the MEC launchers, these are designed to fling payloads from beyond LOS, as long as there is a spotter for the SPARK."
TacticalText="<Bullet/> These launchers may not be able to destroy cover as easily as frag grenades.\n<Bullet/> They make up for it for vast range longer than our grenade launchers."

[RM_SPARKLauncher_MG_Paired X2PairedWeaponTemplate]
FriendlyName="Archer Launcher"
FriendlyNamePlural="Archer Launchers"
BriefSummary="An extended variant of the MEC launchers, these are designed to fling payloads from beyond LOS, as long as there is a spotter for the SPARK."
TacticalText="<Bullet/> These launchers may not be able to destroy cover as easily as frag grenades.\n<Bullet/> They make up for it for vast range longer than our grenade launchers."


[RM_SPARKMissiles X2AbilityTemplate]
LocFriendlyName="Micro Missiles"
LocLongDescription="The SPARK's shoulder mounted missile launcher can volley a salvo of missiles that deal high damage in a small area."
LocHelpText="Target an area with an explosive missle attack."

[RM_FlashRain X2AbilityTemplate]
LocFriendlyName="Flash Rain"
LocLongDescription="The SPARK may deploy flashbang-based ammunition to control enemies on the battlefield."
LocHelpText="Fire a series of flashbangs."
LocFlyOverText="Flash Rain"

[RM_SmokeRain X2AbilityTemplate]
LocFriendlyName="Smoke Rain"
LocLongDescription="The SPARK may deploy smoke bombs to help protect itself or allies."
LocHelpText="Fire smoke bombs."
LocFlyOverText="Smoke Rain"